{
  "apply_layernorm": true,
  "architectures": [
    "Dinov2ForSkinCancer"
  ],
  "attention_probs_dropout_prob": 0.0,
  "drop_path_rate": 0.0,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "melanoma",
    "1": "basal_cell_carcinoma",
    "2": "squamous_cell_carcinoma",
    "3": "dermatofibroma",
    "4": "melanocytic_Nevi"
  },
  "image_size": 518,
  "initializer_range": 0.02,
  "label2id": {
    "basal_cell_carcinoma": 1,
    "dermatofibroma": 3,
    "melanocytic_Nevi": 4,
    "melanoma": 0,
    "squamous_cell_carcinoma": 2
  },
  "layer_norm_eps": 1e-06,
  "layerscale_value": 1.0,
  "mlp_ratio": 4,
  "model_type": "dinov2",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "out_features": [
    "stage12"
  ],
  "out_indices": [
    12
  ],
  "patch_size": 14,
  "qkv_bias": true,
  "reshape_hidden_states": true,
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4",
    "stage5",
    "stage6",
    "stage7",
    "stage8",
    "stage9",
    "stage10",
    "stage11",
    "stage12"
  ],
  "transformers_version": "5.0.0",
  "use_mask_token": true,
  "use_swiglu_ffn": false
}
