{
  "architectures": [
    "Dinov2ForImageClassification"
  ],
  "_name_or_path": "facebook/dinov2-base",
  "model_type": "dinov2",
  "num_labels": 5,
  "id2label": {
    "0": "melanoma",
    "1": "basal_cell_carcinoma",
    "2": "squamous_cell_carcinoma",
    "3": "dermatofibroma",
    "4": "melanocytic_Nevi"
  },
  "label2id": {
    "melanoma": 0,
    "basal_cell_carcinoma": 1,
    "squamous_cell_carcinoma": 2,
    "dermatofibroma": 3,
    "melanocytic_Nevi": 4
  },
  "image_size": 224,
  "hidden_size": 768,
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "patch_size": 14,
  "torch_dtype": "float32",
  "training_info": {
    "dataset": "ISIC 2019 (25,331 images)",
    "num_classes": 5,
    "classes": [
      "melanoma",
      "basal_cell_carcinoma",
      "squamous_cell_carcinoma",
      "dermatofibroma",
      "melanocytic_Nevi"
    ],
    "epochs": 15,
    "learning_rate": 2e-05,
    "batch_size": 64,
    "best_epoch": 11,
    "best_val_f1": 0.8626161388495373,
    "best_val_acc": 0.8999691262735412,
    "optimizer": "AdamW (betas=0.9,0.999, eps=1e-8)",
    "lr_scheduler": "cosine_with_warmup (ratio=0.1)",
    "augmentation": "flip+rotate+colorjitter+affine",
    "class_weights": "inverse_frequency",
    "frozen_layers": "embeddings + first 8/12 transformer layers",
    "mixed_precision": "Native AMP (fp16)"
  }
}